[
    {
      "id": 1,
      "estate_title": "Spacious Single-Family Home",
      "segment_name": "Residential",
      "description": "This beautiful single-family home offers spacious living areas, a large backyard, and modern amenities. It is located in a peaceful neighborhood with easy access to schools, parks, and shopping centers. The home features a cozy living room, a fully equipped kitchen, and a backyard perfect for entertaining guests. With a price of $500,000, this home is ideal for families looking for comfort and convenience.",
      "price": "$500,000",
      "status": "sale",
      "area": "2,500 sq ft",
      "location": "123 Main Street, Anytown",
      "facilities": ["living room", "kitchen", "backyard"],
      "image_url": "https://i.ibb.co/x70ftMS/3d-house-model-with-modern-architecture.jpg"
    },
    {
      "id": 2,
      "estate_title": "Luxurious Townhouse",
      "segment_name": "Residential",
      "description":"Welcome to this luxurious townhouse located in a gated community. This elegant property offers premium features and security for your peace of mind. The townhouse boasts spacious living areas, including a cozy living room and a gourmet kitchen. Outside, you'll find a private swimming pool and a fully equipped gym. With a price of $700,000, this townhouse is perfect for those seeking luxury and comfort.", 
      "price": "$700,000",
      "status": "sale",
      "area": "2,000 sq ft",
      "location": "456 Elm Street, Anytown",
      "facilities": ["living room", "swimming pool", "gym"],
      "image_url": "https://i.ibb.co/KFDDC8f/3d-house-model-with-modern-architecture-1.jpg"
    },
    {
      "id": 3,
      "estate_title": "Modern Apartment",
      "segment_name": "Residential",
      "description": "Experience modern living in this stylish apartment with stunning city views. Located in a vibrant neighborhood, this apartment offers rooftop amenities, including a lounge area and a fitness center. Inside, you'll find spacious living areas, a balcony, and a fully equipped kitchen. With a monthly rent of $2,500, this apartment is perfect for urban dwellers.",
      "price": "$2,500/month",
      "status": "rent",
      "area": "1,200 sq ft",
      "location": "789 Oak Street, Anytown",
      "facilities": ["living room", "balcony", "fitness center"],
      "image_url": "https://i.ibb.co/j4XgtVW/cozy-studio-apartment-with-bedroom-living-space.jpg"
    },
    {
      "id": 4,
      "estate_title": "Cozy Student Housing",
      "segment_name": "Residential",
      "description": "This cozy student housing is conveniently located near campus, offering comfortable living spaces and shared amenities. The housing includes private bedrooms, study areas, and laundry facilities. With a monthly rent of $800, this housing option is ideal for students looking for affordability and convenience.",
      "price": "$800/month",
      "status": "rent",
      "area": "600 sq ft",
      "location": "101 University Avenue, Anytown",
      "facilities": ["bedroom", "study area", "laundry room"],
      "image_url": "https://i.ibb.co/164cr1b/man-bed-with-smartphone.jpg"
    }
  ]